[
  {
    "id": "intro",
    "trigger_type": "distance",
    "trigger_distance": 200,
    "lines": [
      "Oh hey! You're actually controlling me? Cool cool cool.",
      "Name's Po. Skeleton ghost. Fur-trimmed hoodie enthusiast.",
      "My memory gets fuzzy from time to time. And time... sometimes again times...",
      "Ah, Djinn World. Home. Pops told the palace guard to come find me, so I try to street rat it up and gather supplies for the adventures.",
      "Just help me jump over stuff. We'll find Captain Magus and figure out the rest via his idearrhea."
    ]
  },
  {
    "id": "workshop",
    "trigger_type": "distance",
    "trigger_distance": 500,
    "lines": [
      "Hold up. You smell that? Sawdust and lacquer.",
      "And that THING the big cat dropped... what is it?",
      "It's warm. Humming. Like it wants to be part of something bigger.",
      "I think we're near a luthier's workshop.",
      "That's a guitar maker, fam.",
      "...Someone scattered these pieces on purpose. Keep moving."
    ]
  },
  {
    "id": "gallery",
    "trigger_type": "distance",
    "trigger_distance": 900,
    "lines": [
      "Real talk for a second.",
      "You're still here. Playing a run game? That makes you an OG.",
      "You know there's a whole website behind this game, right? Like RIGHT behind it.",
      "Sign up. Save your progress. Get emails about cool stuff — builds, drops, music.",
      "Or don't. I'm not a cop.",
      "...OK back to running. Collecting them all leads to good things..."
    ]
  },
  {
    "id": "invitation",
    "trigger_type": "distance",
    "trigger_distance": 1600,
    "lines": [
      "FOUR pieces. Four out of... I don't even know how many.",
      "But I can FEEL them now. They're pulling me forward.",
      "There's a place up ahead — Shelley Guitar. Custom builds, wild designs.",
      "These pieces — they're connected to whoever built this place.",
      "Every time those big freaks show up, I get to MOVE for a second.",
      "Like the fight breaks the rules. Like the cage has cracks."
    ]
  },
  {
    "id": "the_break",
    "trigger_type": "piece_collected",
    "trigger_count": 6,
    "lines": [
      "Wait. WAIT. What's happening?",
      "The world... it stopped. The scrolling. The endless running.",
      "SIX pieces. That's all six.",
      "We gotta get Magus.",
      "...",
      "Follow me."
    ],
    "signal": "morph_to_platformer"
  },
  {
    "id": "first_steps",
    "trigger_type": "post_morph_timer",
    "trigger_delay": 30,
    "lines": [
      "This is wild. Actual freedom of movement.",
      "There's a platform up there... and is that a DOOR?",
      "Captain Magus built this whole place. The architect. The mad scientist.",
      "I bet there's way more to find if we keep looking."
    ]
  },
  {
    "id": "magus_meeting",
    "trigger_type": "area_entered",
    "trigger_area": "amphitheatre",
    "lines": [
      {"speaker": "Po", "text": "Captain? You're HERE?"},
      {"speaker": "Magus", "text": "Of course. Where'd you think I'd be?"},
      {"speaker": "Po", "text": "*stares off blankly....*"},
      {"speaker": "Magus", "text": "How's mom?"},
      {"speaker": "Po", "text": "*snaps back* I haven't called her in well over a week."},
      {"speaker": "Magus", "text": "Well don't just stand there — hand me that diamond coated file behind you."}
    ]
  },
  {
    "id": "explore_complete",
    "trigger_type": "area_entered",
    "trigger_area": "exit_portal",
    "lines": [
      "Alright! We cracked this place open.",
      "There's a whole site out there — builds, stories, music, everything.",
      "Go explore. I'll be around. I'm literally embedded in this website.",
      "And if you see any glowing orbs lying around... they're MINE.",
      "Po out. *morphs into the footer*"
    ],
    "signal": "onboarding_complete"
  }
]
